Функция ПолучитьДанныеПользователя(Пользователь) Экспорт

	СтруктураДанных = Новый Структура("Логин, Пароль, Токен, Email");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсВО_ПользователиGit.Логин КАК Логин,
		|	ВерсВО_ПользователиGit.Пароль КАК Пароль,
		|	ВерсВО_ПользователиGit.Токен КАК Токен,
		|	ВерсВО_ПользователиGit.Email КАК Email
		|ИЗ
		|	РегистрСведений.ВерсВО_ПользователиGit КАК ВерсВО_ПользователиGit
		|ГДЕ
		|	ВерсВО_ПользователиGit.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции
