Процедура ИнициализироватьКонстанты() Экспорт

	МассивКонстант = ВерсВО_ОбщегоНазначения.ПолучитьСтруктуруКонстант();
	ЗаписатьЗначенияКонстант(МассивКонстант);
	
КонецПроцедуры

Процедура ЗаписатьЗначенияКонстант(Константы) Экспорт
	
	Для Каждого Константа Из Константы Цикл
		ЭлементКонстанты = Справочники.ВерсВО_Константы.НайтиПоНаименованию(Константа.Ключ);
		Если ЭлементКонстанты = Неопределено Или Не ЗначениеЗаполнено(ЭлементКонстанты) Тогда
			ЭлементКонстанты = Справочники.ВерсВО_Константы.СоздатьЭлемент();
			ЭлементКонстанты.Наименование = Константа.Ключ;
		Иначе
			ЭлементКонстанты = ЭлементКонстанты.ПолучитьОбъект();
		КонецЕсли;
		ЭлементКонстанты.Значение = Константа.Значение;
		ЭлементКонстанты.Записать();
	КонецЦикла;
	
КонецПроцедуры

