
&НаСервере
Процедура ИнициализироватьНастройкиВерсионированияНаСервере()
	
	Справочники.ВерсВО_Константы.ИнициализироватьКонстанты();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьНастройкиВерсионирования(Команда)
	ИнициализироватьНастройкиВерсионированияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройкиНаСервере() 
	
	Если ВерсВО_ОбщегоНазначения.ПроверитьНаличиеГит() И
		ВерсВО_ОбщегоНазначения.ПроверитьПодключениеКГит() Тогда
		Сообщить("Проверка подключения выполнена успешно!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройки(Команда)
	ПроверитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодключитьсяКGitНаСервере()
	
	ПутьКРепо = ВерсВО_ОбщегоНазначения.КлонироватьРепозиторий();
	ВерсВО_ОбщегоНазначения.ПервичнаяВыгрузкаСправочникаОбработок(ПутьКРепо);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКGit(Команда)
	ПодключитьсяКGitНаСервере();
КонецПроцедуры
