
&НаКлиенте
Процедура ВерсВО_НастройкиВерсионированияВместо(Команда)
	ОткрытьФорму("Справочник.ВерсВО_Константы.Форма.ФормаМенеджерНастройки",, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ВерсВО_ВыгрузитьВсеВХранилищеВместоНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВерсВО_ВыгрузитьВсеВХранилищеВместо(Команда)
	ВерсВО_ВыгрузитьВсеВХранилищеВместоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВерсВО_ЗагрузитьВсеИзХранилищаВместоНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВерсВО_ЗагрузитьВсеИзХранилищаВместо(Команда)
	ВерсВО_ЗагрузитьВсеИзХранилищаВместоНаСервере();
КонецПроцедуры
